def d():
    x = input('Введите что-нибудь') 
    b = []
    while x != '':  
        b.append(x)
        x = input()
    l = int(input('Введите число k = '))
    while l > 0:
        b = b[-1:] + b[:-1]
        l = l - 1
    return b 
print(d())

def d():
    assert d(2,[1, 2, 3, 4, 5] == [4, 5, 1, 2, 3]), "Ошибка"
    assert d(3,[1, 2, 3, 4, 5] == [3, 4, 5, 1, 2]), "Ошибка"
    assert d(0,[1, 2, 3, 4, 5] == [1, 2, 3, 4, 5]), "Ошибка"
    assert d(7,[1, 2, 3, 4, 5] == [4, 5, 1, 2, 3]), "Ошибка" 